# -*- coding = utf-8 -*-
# Time: 2022/3/17 21:42
# Author: Mr Wu
# File: demo3.py
# Software: PyCharm

#  4:00000100
#  8:00001000
#  &(按位与):有0则0
print(4&8)  #  0
#  |(按位或)：有1则1
print(4|8)  #  1100-->12
#  <<(左移):高位溢出舍弃，低位补0  左移一位相当于乘以2
print(4<<2)  #  00010000-->16
#  >>(右移)：低位溢出舍弃，高位补0  右移一位相当于除以2
print(4>>2)  #  00000001-->1

"""
算术运算符：**、*、/、//、%、+、-
位运算符：<<、>>、&、|
比较运算符：>、<、>=、<=、==、!=
逻辑运算符：not、and、or
赋值运算符：=

运算符的优先级(优先级从高到低)
算术运算符:(**) --> (*、/、//、%) --> (+、-) -->
位运算符:(>>、<<) --> (&) --> (|) -->
比较运算符:(>、<、>=、<=、==、!=) -->
逻辑运算符:(not) -->(and) -->(or) -->
赋值运算符:(=)
"""

"""
python一切皆对象，所有对象都有一个布尔值
获取对象的布尔值使用内置函数boll()
"""
print('----------以下对象的布尔值为Flase----------')
print('Flase',bool(False))  #  False
print('0',bool(0))  #  数值0
print('0.0',bool(0.0))  #  数值0.0
print('None',bool(None))  #  None
print('',bool(''))  #  空字符串
print('[]',bool([]))  #  空列表
print('list()',bool(list()))  #  空列表
print('()',bool(()))  #  空元组
print('tuple()',bool(tuple()))  #  空元组
print('{}',bool({}))  #  空字典
print('dic()',bool(dict()))  #  空字典
print('set()',bool(set()))  #  空集合
print('----------其它对象的布尔值均为True---------')

# pass语句：什么都不做，只是一个占位符，用在语法上需要语句的地方
a = 100
if a >= 100:
    pass
else:
    pass
