# -*- coding = utf-8 -*-
# Time: 2022/4/8 21:08
# Author: Mr Wu
# File: 6.函数的参数总结.py
# Software: PyCharm

# 1.将序列中的每个元素都转换为位置实参：使用*
def fun(a,b,c): #a,b,c在函数的定义处，所以是形式参数
    print('a=',a)
    print('b=',b)
    print('c=',c)
lst=[11,22,33]
fun(*lst)  # 在函数调用时，将列表中的每个元素都转换为位置实参传入
print('2.----------------------------------------------------')

# 2.将字典中的每个键值对都转换为关键字实参：使用**
def fun(a,b,c): #a,b,c在函数的定义处，所以是形式参数
    print('a=',a)
    print('b=',b)
    print('c=',c)
dic={'a':111,'b':222,'c':333}
fun(**dic)  # 在函数调用时，将字典中的键值对都转换为关键字实参传入
print('3.----------------------------------------------------')

# 3.默认值形参
def fun(a,b=110):  # b是在函数的定义处，所以b是形参，而且进行了赋值，所以b称为默认值形参
    print('a=',a)
    print('b=',b)
fun(100)
print('4.----------------------------------------------------')

# 4.位置实参
def fun(a,b):
    print('a=', a)
    print('b=', b)
fun(10,20)
print('5.----------------------------------------------------')

# 5，关键字形参
def fun(a,b):
    print('a=', a)
    print('b=', b)
fun(a=10,b=20)
print('6.----------------------------------------------------')

# 6.个数可变的位置形参
def fun(*args):
    print(args)
fun(10,20,30)
print('7.----------------------------------------------------')

# 7.个数可变的关键字形参
def fun(**args):
    print(args)
fun(a=10,b=20,c=30)
print('8.----------------------------------------------------')

#8.位置实参、关键字形参的混合传递
def fun(a,b,c,d):
    print('a=', a)
    print('b=', b)
    print('c=', c)
    print('d=', d)
fun(10,20,c=30,d=40)  # 前两个参数，采用的是位置实参传递，而c,d采用的是关键字实参传递
print('-------------------------------------------------------')

def fun(a,b,*,c,d):  # 从*之后的参数，在函数调用时，只能采用关键字参数传递
    print('a=', a)
    print('b=', b)
    print('c=', c)
    print('d=', d)
fun(10,20,c=30,d=40)
# fun(10,20,30,d=40)  # 报错
print('9.----------------------------------------------------')

# 9.位置实参、关键字形参、个数可变的关键字形参的混合传递
def fun(a,b,*,c,d,**args):
    print('a=', a)
    print('b=', b)
    print('c=', c)
    print('d=', d)
    print('args=', args)
fun(10,20,c=30,d=40,e=50,f=60)
print('10.----------------------------------------------------')

# 10.个数可变的位置形参与个数可变的关键字形参的混合传递
def fun(*args,**args1):
    print('args=', args)
    print('args1=', args1)
fun(10,20,30,d=40,e=50,f=60)
print('11.----------------------------------------------------')

# 11.位置实参、默认值形参、个数可变的位置形参、个数可变的关键字形参的混合传递
def fun(a,b=20,*args,**args1):
    print('a=', a)
    print('b=', b)
    print('args=', args)
    print('args1=', args1)
fun(10,20,30,c=40,d=50)